logic-backend/load-test.yml
config:
  target: 'http://localhost:3000'  
  phases:
    - duration: 60  # Тривалість тесту в секундах
      arrivalRate: 5  # Кількість нових користувачів (запитів) на секунду

scenarios:
  - flow:
      - post:
          url: '/api/auth/login'
          json:
            email: 'testuser@example.com'
            password: 'Test@1234'